# LanLink 交互模式使用指南

## 📖 简介

**交互模式**是 LanLink 1.1 新增的功能，提供类似 Redis CLI 或 Docker CLI 的友好交互体验。

在交互模式下，您可以：
- ✅ 直接输入命令，无需每次都输入 `lanlink` 前缀
- ✅ 查看彩色格式化输出
- ✅ 使用命令简写和别名
- ✅ 获得即时反馈和提示

---

## 🚀 快速开始

### 启动交互模式

```bash
# 方法 1：直接运行（推荐）
lanlink

# 方法 2：使用 interactive 命令
lanlink interactive

# 方法 3：使用简写
lanlink i
```

### 欢迎界面

启动后您会看到：

```
╔════════════════════════════════════════════════════════╗
║          LanLink Interactive Shell                    ║
╚════════════════════════════════════════════════════════╝
  版本: 1.0.0
  构建: latest

💡 提示：
  - 输入命令直接执行，无需前缀 'lanlink'
  - 输入 'help' 查看所有命令
  - 输入 'clear' 清屏
  - 输入 'exit' 或 'quit' 退出

lanlink>
```

---

## 📋 可用命令

### 🔍 查询命令

| 命令 | 别名 | 说明 | 示例 |
|------|------|------|------|
| `status` | `st` | 查看 LanLink 运行状态 | `status` |
| `list` | `ls` | 列出所有已发现的节点 | `list` |
| `logs` | `log` | 查看日志 | `logs -f` |
| `ping` | - | 测试与指定节点的连接 | `ping server1.local` |
| `version` | `v` | 显示版本信息 | `version` |
| `help` | `h`, `?` | 显示帮助信息 | `help` |

### 🛠️ 系统命令

| 命令 | 说明 |
|------|------|
| `clear` 或 `cls` | 清屏 |
| `exit`, `quit`, `q` | 退出交互模式 |

### ⚙️ 管理命令（需要管理员权限）

这些命令建议退出交互模式后，以管理员身份运行：

| 命令 | 说明 |
|------|------|
| `install` | 安装到系统 PATH |
| `uninstall` | 从系统 PATH 卸载 |
| `service install` | 安装为系统服务（开机自启） |
| `service start` | 启动服务 |
| `service stop` | 停止服务 |
| `service status` | 查看服务状态 |

---

## 💡 使用示例

### 示例 1：查看系统状态

```
lanlink> status
✓ LanLink 运行中
  进程ID: 12345
  运行时间: 2小时30分钟
  配置文件: config.json
  日志文件: lanlink.log
```

### 示例 2：列出所有节点

```
lanlink> list

━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
  已发现的节点
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

在线节点 (3):
  1. ✓ lifeng-book.local
       IP: 192.168.1.102
       设备: lifeng-book [本机]
       
  2. ✓ server1.local
       IP: 192.168.1.100
       设备: server1
       最后心跳: 5秒前
       
  3. ✓ server2.local
       IP: 192.168.1.101
       设备: server2
       最后心跳: 3秒前
```

### 示例 3：实时查看日志

```
lanlink> logs -f
[2025-11-27 15:30:00] [INFO] 收到心跳: server1.local
[2025-11-27 15:30:05] [INFO] 收到心跳: server2.local
[2025-11-27 15:30:10] [INFO] 已发送心跳
^C (按 Ctrl+C 停止)
```

### 示例 4：测试连接

```
lanlink> ping server1.local
正在 ping server1.local (192.168.1.100)...
✓ 成功连接到 server1.local
  响应时间: 2ms
  TTL: 64
```

### 示例 5：使用简写命令

```
lanlink> st        # status 的简写
lanlink> ls        # list 的简写
lanlink> v         # version 的简写
lanlink> log -f    # logs 的简写
```

### 示例 6：查看帮助

```
lanlink> help

📚 可用命令：

🔍 查询命令:
  status       [st]         查看 LanLink 运行状态
  list         [ls]         列出所有已发现的节点
  logs         [log]        查看日志（-f 实时跟踪，-n 指定行数）
  ping                      测试与指定节点的连接
  version      [v]          显示版本信息
...
```

### 示例 7：清屏

```
lanlink> clear    # 或 cls
(清空屏幕)
```

### 示例 8：退出

```
lanlink> exit     # 或 quit、q

👋 再见！感谢使用 LanLink
```

---

## 🎯 交互模式 vs 命令行模式

### 交互模式（推荐日常使用）

```bash
# 启动
lanlink

# 然后可以连续执行多个命令
lanlink> status
lanlink> list
lanlink> logs -f
lanlink> exit
```

**优点：**
- ✅ 无需重复输入 `lanlink`
- ✅ 支持命令别名和简写
- ✅ 更好的用户体验
- ✅ 适合探索和调试

### 命令行模式（适合脚本和自动化）

```bash
# 每次执行一个命令
lanlink status
lanlink list
lanlink logs -f
```

**优点：**
- ✅ 适合脚本调用
- ✅ 适合自动化任务
- ✅ 可以与其他命令组合使用（管道）

---

## 🔧 高级技巧

### 1. 日志查看选项

```bash
# 查看最后 100 行日志
lanlink> logs -n 100

# 实时跟踪日志
lanlink> logs -f

# 组合使用
lanlink> logs -n 50 -f
```

### 2. 列表过滤

```bash
# 只显示在线节点
lanlink> list --online

# 显示详细信息
lanlink> list --verbose
```

### 3. 连续操作

```bash
lanlink> status
lanlink> list
lanlink> ping server1.local
lanlink> logs -n 20
```

---

## ⚠️ 注意事项

### 权限相关

在交互模式中，**管理命令**（`install`, `uninstall`, `service`）会提示您退出后执行：

```
lanlink> install
⚠ install 命令需要管理员权限，建议退出交互模式后执行：
   以管理员身份运行: lanlink install
```

**正确做法：**

```bash
# 1. 退出交互模式
lanlink> exit

# 2. Windows: 以管理员身份运行
lanlink install

# 3. Linux/Mac: 使用 sudo
sudo lanlink install
```

### Ctrl+C 行为

- 在**交互模式主界面**：按 `Ctrl+C` 不会退出，请使用 `exit`
- 在**实时日志**（`logs -f`）：按 `Ctrl+C` 停止跟踪，返回交互界面
- 在**运行服务**：按 `Ctrl+C` 会优雅退出服务

---

## 🎨 界面特性

### 彩色输出

交互模式支持彩色输出，让信息更清晰：

- 🟢 **绿色** - 成功、在线状态
- 🔴 **红色** - 错误、离线状态
- 🟡 **黄色** - 警告、提示
- 🔵 **青色** - 标题、分隔线
- ⚪ **灰色** - 次要信息

### 格式化输出

所有命令都经过精心格式化：

- 使用 Unicode 字符（✓、✗、━）
- 对齐的表格和列表
- 清晰的分隔线
- 直观的图标

---

## 🆚 与其他工具对比

| 特性 | LanLink 交互模式 | Redis CLI | Docker CLI | MySQL CLI |
|------|-----------------|-----------|------------|-----------|
| 交互式输入 | ✅ | ✅ | ❌ | ✅ |
| 命令别名 | ✅ | ✅ | ✅ | ✅ |
| 彩色输出 | ✅ | ✅ | ✅ | ✅ |
| 实时日志 | ✅ | ❌ | ✅ | ❌ |
| 清屏支持 | ✅ | ✅ | ❌ | ✅ |

---

## 📚 相关文档

- [CLI 使用指南](./CLI使用指南.md) - 命令行模式详细说明
- [观测指南](./观测指南.md) - 系统监控和调试
- [安装与服务管理](./安装与服务管理.md) - 安装和服务配置

---

## 🐛 故障排除

### 问题 1：彩色输出不正常

**症状：** 看到乱码或 ANSI 转义序列

**解决：**
- Windows 10+ 默认支持彩色输出
- 使用现代终端（Windows Terminal、PowerShell 7+）
- 如果仍有问题，请更新终端软件

### 问题 2：命令无响应

**症状：** 输入命令后没有输出

**解决：**
1. 检查 LanLink 服务是否在运行：`status`
2. 检查配置文件是否存在：`config.json`
3. 查看日志：`logs -n 50`

### 问题 3：无法退出

**症状：** 输入 `exit` 无效

**解决：**
- 确保输入完整的 `exit` 命令
- 或使用 `quit` 或 `q`
- 最后手段：按 `Ctrl+C` 多次

---

## 💬 反馈

如果您对交互模式有任何建议，欢迎在 [GitHub](https://github.com/618lf/lanlink) 提交 Issue 或 PR！

---

**提示：** 交互模式是日常使用的推荐方式，让您的 LanLink 体验更加流畅！🎉

